cmsis-svd/cmsis-svd/data/Holtek/HT32F125x.svd
        <!--FMC_PPSR1-->
        <register>
          <name>FMC_PPSR1</name>
          <displayName>FMC_PPSR1</displayName>
          <description>FMC_PPSR1</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PPSB</name>
              <description>PPSB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--FMC_PPSR2-->
        <register>
          <name>FMC_PPSR2</name>
          <displayName>FMC_PPSR2</displayName>
          <description>FMC_PPSR2</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PPSB</name>
              <description>PPSB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--FMC_PPSR3-->
        <register>
          <name>FMC_PPSR3</name>
          <displayName>FMC_PPSR3</displayName>
          <description>FMC_PPSR3</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PPSB</name>
              <description>PPSB</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--FMC_CPSR-->
        <register>
          <name>FMC_CPSR</name>
          <displayName>FMC_CPSR</displayName>
          <description>FMC_CPSR</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CPSB</name>
              <description>CPSB</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>OBPSB</name>
              <description>OBPSB</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--FMC_VMCR-->
        <register>
          <name>FMC_VMCR</name>
          <displayName>FMC_VMCR</displayName>
          <description>FMC_VMCR</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>VMCB</name>
              <description>VMCB</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--FMC_CFCR-->
        <register>
          <name>FMC_CFCR</name>
          <displayName>FMC_CFCR</displayName>
          <description>FMC_CFCR</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>WAIT</name>
              <description>WAIT</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PFBE</name>
              <description>PFBE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>IPSE</name>
              <description>IPSE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--FMC_SBVT0-->
        <register>
          <name>FMC_SBVT0</name>
          <displayName>FMC_SBVT0</displayName>
          <description>FMC_SBVT0</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SBVT</name>
              <description>SBVT</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--FMC_SBVT1-->
        <register>
          <name>FMC_SBVT1</name>
          <displayName>FMC_SBVT1</displayName>
          <description>FMC_SBVT1</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SBVT</name>
              <description>SBVT</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--FMC_SBVT2-->
        <register>
          <name>FMC_SBVT2</name>
          <displayName>FMC_SBVT2</displayName>
          <description>FMC_SBVT2</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SBVT</name>
              <description>SBVT</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
