cmsis-svd/cmsis-svd/data/Holtek/HT32F125x.svd
      </registers>
    </peripheral>
    <!--ADC-->
    <peripheral>
      <name>ADC</name>
      <version>1.1</version>
      <description>ADC</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40010000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>ADC</name>
        <value>25</value>
      </interrupt>
      <registers>
        <!--ADC_RST-->
        <register>
          <name>ADC_RST</name>
          <displayName>ADC_RST</displayName>
          <description>ADC_RST</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADRST</name>
              <description>ADRST</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_CONV-->
        <register>
          <name>ADC_CONV</name>
          <displayName>ADC_CONV</displayName>
          <description>ADC_CONV</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADMODE</name>
              <description>ADMODE</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQL</name>
              <description>ADSEQL</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSUBL</name>
              <description>ADSUBL</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_LST0-->
        <register>
          <name>ADC_LST0</name>
          <displayName>ADC_LST0</displayName>
          <description>ADC_LST0</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADSEQ0</name>
              <description>ADSEQ0</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ1</name>
              <description>ADSEQ1</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ2</name>
              <description>ADSEQ2</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ3</name>
              <description>ADSEQ3</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_LST1-->
        <register>
          <name>ADC_LST1</name>
          <displayName>ADC_LST1</displayName>
          <description>ADC_LST1</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADSEQ4</name>
              <description>ADSEQ4</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ5</name>
              <description>ADSEQ5</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ6</name>
              <description>ADSEQ6</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADSEQ7</name>
              <description>ADSEQ7</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR0-->
        <register>
          <name>ADC_STR0</name>
          <displayName>ADC_STR0</displayName>
          <description>ADC_STR0</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST0</name>
              <description>ADST0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR1-->
        <register>
          <name>ADC_STR1</name>
          <displayName>ADC_STR1</displayName>
          <description>ADC_STR1</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST1</name>
              <description>ADST1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_STR2-->
        <register>
          <name>ADC_STR2</name>
          <displayName>ADC_STR2</displayName>
          <description>ADC_STR2</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADST2</name>
              <description>ADST2</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
