cmsis-svd/cmsis-svd/data/Holtek/HT32F125x.svd
        <!--CMPIER1-->
        <register>
          <name>CMPIER1</name>
          <displayName>CMPIER1</displayName>
          <description>CMPIER1</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CF1IEN</name>
              <description>CF1IEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CR1IEN</name>
              <description>CR1IEN</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CMPRSR1-->
        <register>
          <name>CMPRSR1</name>
          <displayName>CMPRSR1</displayName>
          <description>CMPRSR1</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CF1RAW</name>
              <description>CF1RAW</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CR1RAW</name>
              <description>CR1RAW</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CMPISR1-->
        <register>
          <name>CMPISR1</name>
          <displayName>CMPISR1</displayName>
          <description>CMPISR1</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CF1IS</name>
              <description>CF1IS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CR1IS</name>
              <description>CR1IS</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--CMPICLR1-->
        <register>
          <name>CMPICLR1</name>
          <displayName>CMPICLR1</displayName>
          <description>CMPICLR1</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CF1ICLR</name>
              <description>CF1ICLR</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CR1ICLR</name>
              <description>CR1ICLR</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!--GPTM0-->
    <peripheral>
      <name>GPTM0</name>
      <version>1.1</version>
      <description>GPTM0</description>
      <groupName>GPTM</groupName>
      <baseAddress>0x4006E000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>GPTM0</name>
        <value>35</value>
      </interrupt>
      <registers>
        <!--GPTM0_CNTCFR-->
        <register>
          <name>GPTM_CNTCFR</name>
          <displayName>GPTM_CNTCFR</displayName>
          <description>GPTM_CNTCFR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>UEVDIS</name>
              <description>UEVDIS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>UGDIS</name>
              <description>UGDIS</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CKDIV</name>
              <description>CKDIV</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CMSEL</name>
              <description>CMSEL</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DIR</name>
              <description>DIR</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_MDCFR-->
        <register>
          <name>GPTM_MDCFR</name>
          <displayName>GPTM_MDCFR</displayName>
          <description>GPTM_MDCFR</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TSE</name>
              <description>TSE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SMSEL</name>
              <description>SMSEL</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>MMSEL</name>
              <description>MMSEL</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SPMSET</name>
              <description>SPMSET</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_TRCFR-->
        <register>
          <name>GPTM_TRCFR</name>
          <displayName>GPTM_TRCFR</displayName>
          <description>GPTM_TRCFR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TRSEL</name>
              <description>TRSEL</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ETF</name>
              <description>ETF</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ETIPSC</name>
              <description>ETIPSC</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ETIPOL</name>
              <description>ETIPOL</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ECME</name>
              <description>ECME</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CTR-->
        <register>
          <name>GPTM_CTR</name>
          <displayName>GPTM_CTR</displayName>
          <description>GPTM_CTR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TME</name>
              <description>TME</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CRBE</name>
              <description>CRBE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH0ICFR-->
        <register>
          <name>GPTM_CH0ICFR</name>
          <displayName>GPTM_CH0ICFR</displayName>
          <description>GPTM_CH0ICFR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TI0F</name>
              <description>TI0F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH0CCS</name>
              <description>CH0CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH0PSC</name>
              <description>CH0PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TI0SRC</name>
              <description>TI0SRC</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPTM0_CH1ICFR-->
        <register>
          <name>GPTM_CH1ICFR</name>
          <displayName>GPTM_CH1ICFR</displayName>
          <description>GPTM_CH1ICFR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TI1F</name>
              <description>TI1F</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1CCS</name>
              <description>CH1CCS</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CH1PSC</name>
              <description>CH1PSC</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
